let part1 = "Я прийшов, тебе нема, пiдманула, пiдвела.\n\
Ти ж мене пiдманула, ти ж мене пiдвела.\n\
Ти ж мене, молодого, з ума розуму звела."

let poem = `\
Ти казала в понедiлок – пiдем разом по барвiнок.\
${part1}\
Я казала у вiвторок – поцiлую разiв сорок.\n\
Ти прийшов, мене нема, пiдманула, пiдвела.\n\
Я ж тебе пiдманула, я ж тебе пiдвела.\n\
Я ж тебе, молодого, з ума розуму звела.\n\
Ти казала у середу – пiдем разом по череду.\n\
${part1}
                                    (Народна пісня)`

alert(poem)