let money = parseFloat(prompt("Сколько денег (в у.е.) в месяц вам достаточно, чтобы нормально себя чувствовать и позволять себе все, что хочется?"));
if (money <= 100) {
    alert("Скромные у тебя запросы")
}
else if (money >= 101 && money <= 300) {
    alert("Тебе точно хватает?")
}
else if (money >= 301 && money <= 500) {
    alert("Наверно, работу удачно нашел...")
}
else if (money >= 501 && money <= 1000) {
    alert("Ты сам эти деньги зарабатываешь?")
}
else if (money >= 1001) {
    alert("Ты бизнесмен?")
}